import { Layout } from "../layouts/Layout";

export function Disclaimer() {
  return (
    <Layout>
      <div class="prose dark:prose-invert max-w-full">
        <h1>网站声明与免责条款</h1>
        <p>最后更新日期：2025年6月18日</p>
        <p>欢迎访问 七圣召唤模拟器（以下简称“本网站”）。</p>
        <p>在您使用本网站之前，请仔细阅读并充分理解以下所有条款。无论您是否完整阅读，您访问和使用本网站的行为，即表示您已无条件同意并接受本声明与条款的约束。</p>
        <h2>第一条：总则</h2>
        <p>本网站是一个《原神》的《七圣召唤》玩法的非官方模拟对战平台，旨在为广大用户提供技术交流。</p>
        <h2>第二条：版权归属</h2>
        <h3>2.1 原作版权</h3>
        <p>本网站上发布的所有关于《原神》的衍生内容（包括但不限于文案、图片等），其原作角色、世界观、及相关元素的版权，均归属于上海米哈游网络科技股份有限公司所有。本网站的设立和内容发布，均基于对原作的喜爱和尊重，不代表任何官方立场，且与原作版权方无任何商业合作关系。</p>
        <h3>2.2 本站原创内容版权</h3>
        <p>本网站所包含的原创内容，包括但不限于网站的整体结构、网页设计、布局、文字、图表、代码、原创文章及评论，其知识产权均归属 <a href="https://github.com/genius-invokation" target="_blank" rel="noopener noreferrer">© github/genius-invokation</a> 所有。</p>
        <p>任何单位或个人未经本网站书面授权，不得以任何方式或理由对上述内容进行使用、复制、修改、抄录、传播、逆向工程或与其他产品捆绑使用、销售。</p>
        <h2>第三条：免责条款</h2>
        <h3>3.1 信息准确性</h3>
        <p>本网站发布的所有信息仅供参考和学习交流之用。我们尽力确保信息的准确性和时效性，但不对其内容的真实性、完整性、准确性或可靠性做出任何明示或暗示的保证。任何因依赖本网站内容而采取的行动，其风险由用户自行承担，本网站不承担任何直接或间接的法律责任。</p>
        <h3>3.2 专业建议</h3>
        <p>本网站的任何内容均不构成财务、法律、医疗、投资或其他任何领域的专业建议。在做出任何相关决策前，您应咨询具备相应资质的专业人士。</p>
        <h3>3.3 外部链接</h3>
        <p>本网站可能包含指向第三方网站的链接。这些链接仅为提供便利，并不代表本网站对这些网站及其内容的认可、推荐或担保。我们无法控制这些第三方网站，也不对其内容的合法性、安全性或因使用这些内容而导致的任何损失或损害负责。</p>
        <h3>3.4 技术风险</h3>
        <p>我们不保证本网站的服务不会中断，也不保证网站或其服务器不受病毒或其他有害组件的侵害。因任何技术故障、网络中断、计算机病毒、黑客攻击等不可抗力因素所造成的用户损失，本网站不承担责任。</p>
        <h2>第四条：侵权通知</h2>
        <p>我们尊重并保护所有知识产权。如果您认为本网站的任何内容侵犯了您的合法权益（包括但不限于著作权、商标权、肖像权等），请立即通过以下方式与我们联系：</p>
        <p>联系邮箱： guyutongxue@163.com</p>
        <p>在您的侵权通知中，请务必提供以下信息：</p>
        <ul>
            <li>您的姓名和联系方式。</li>
            <li>您声称受到侵权的权利证明文件（如版权登记证书、商标注册证等）。</li>
            <li>您声称侵权内容的具体网络链接（URL）及相关描述。</li>
            <li>您声明通知中的信息真实、准确，并且您是权利人或已获合法授权的声明。</li>
        </ul>
        <p>我们在收到您的有效通知后，将在合理时间内进行核实，并根据法律法规采取包括删除相关内容在内的必要措施。</p>
        <h2>第五条：隐私政策</h2>
        <p>本网站尊重并保护用户的个人隐私。我们如何收集、使用和保护您的个人数据，已在<a href="/privacy">《隐私政策》</a>页面中详细说明。访问本网站即表示您同意我们的<a href="/privacy">《隐私政策》</a>。</p>
        <h2>第六条：条款修改</h2>
        <p>本网站保留在任何时候自行决定修改、更新本声明与条款的权利，恕不另行通知。所有修改将自发布之日起立即生效。我们建议您定期查阅本页面，以了解最新的条款内容。</p>
      </div>
    </Layout>
  );
}
