import { Layout } from "../layouts/Layout";

export function Privacy() {
  return (
    <Layout>
      <div class="prose dark:prose-invert max-w-full">
        <h1>隐私政策</h1>
        <p>最后更新日期：2025年6月18日</p>
        <p>
          欢迎访问 七圣召唤模拟器（以下简称“本网站”）。我们非常重视您的个人隐私，并致力于保护您的个人数据。本隐私政策旨在向您说明我们如何收集、使用、存储、共享和保护您的信息。
        </p>

        <h2>一、我们收集哪些信息</h2>
        <p>
          当您使用本网站时，我们可能会收集以下类型的信息：
        </p>
        <ul>
          <li>
            <strong>您主动提供的信息</strong>：例如，您在注册账户、填写表单或联系我们时，可能需要提供您的昵称、电子邮件地址等。
          </li>
          <li>
            <strong>我们自动收集的信息</strong>：当您访问本网站时，我们的服务器会自动记录一些信息，包括您的IP地址、浏览器类型、访问时间、引荐网址以及您在本网站上的操作记录。我们通过 Cookies 和类似技术来收集这些信息，以优化您的用户体验并用于网站分析。
          </li>
        </ul>

        <h2>二、我们如何使用您的信息</h2>
        <p>
          我们收集您的信息主要用于以下目的：
        </p>
        <ul>
          <li>提供、维护和改进本网站的服务。</li>
          <li>实现您的个性化需求，为您推荐您可能感兴趣的内容。</li>
          <li>与您沟通，回复您的咨询和请求。</li>
          <li>用于数据分析，以了解用户如何使用我们的服务，从而提升服务质量。</li>
          <li>遵守法律法规的要求。</li>
        </ul>

        <h2>三、我们如何共享、转让、公开披露您的信息</h2>
        <p>
          我们承诺对您的信息进行严格保密。除以下情况外，我们不会与任何第三方共享您的个人信息：
        </p>
        <ul>
          <li>已获得您的明确同意。</li>
          <li>根据法律法规的规定或行政、司法机关的强制性要求。</li>
          <li>为了维护本网站、您或其他用户的合法权益。</li>
          <li>在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束。</li>
        </ul>

        <h2>四、我们如何保护您的信息</h2>
        <p>
          我们采用了符合业界标准的安全技术和措施来保护您的个人信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。
        </p>

        <h2>五、您对个人信息的权利</h2>
        <p>
          您对自己的个人信息拥有以下权利：
        </p>
        <ul>
          <li>随时访问和更正您的个人信息。</li>
          <li>在符合相关法律法规的情况下，请求删除您的个人信息。</li>
          <li>改变您授权同意的范围或撤回您的授权。</li>
        </ul>
        <p>您可以通过我们提供的联系方式来行使这些权利。</p>

        <h2>六、Cookies 的使用</h2>
        <p>
          为了确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookies 的小数据文件。Cookies 通常包含标识符、站点名称以及一些数字和字符。借助于
          Cookies，我们能够存储您的偏好等数据，并判断注册用户是否已登录。您可根据自己的偏好管理或删除 Cookies。
        </p>

        <h2>七、隐私政策的更新</h2>
        <p>
          我们可能会适时对本隐私政策进行修订。当政策的条款发生变更时，我们会在本页面上发布更新后的版本，并在此类变更生效前通过网站公告或适当方式通知您。我们建议您定期查看本页面以获取最新信息。
        </p>

        <h2>八、如何联系我们</h2>
        <p>
          如果您对本隐私政策有任何疑问、意见或建议，请通过以下方式与我们联系：
        </p>
        <p>联系邮箱：guyutongxue@163.com</p>
      </div>
    </Layout>
  );
}
